# Taps
tap 'argoproj/tap'
tap 'homebrew/bundle'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'kajabi/kjctl', 'git@github.com:Kajabi/kjctl.git'
tap 'nicoverbruggen/homebrew-cask'
tap 'puma/puma'
tap 'stripe/stripe-cli'
tap 'ynqa/tap'

# Core
brew 'the_silver_searcher' # the silver searcher
brew 'awscli' # AWS CLI
brew 'bat' # Cat with wings
brew 'coreutils' # macOS are outdated
brew 'curl' # Curl
brew 'diff-so-fancy' # Better diff
brew 'eza' # Ls with colors
brew 'gh' # Github CLI
brew 'git' # Git
brew 'git-delta' # Better diff for git
brew 'glow' # Markdown reader
brew 'gpg' # GPG
brew 'htop' # Better top
brew 'imagemagick' # ImageMagick
brew 'jnv' # JSON navigator
brew 'jq' # JSON processor
brew 'kjctl' # KJCTL
brew 'kustomize' # Kustomize
brew 'mas' # Mac App Store CLI
brew 'mcfly' # Better history
brew 'minikube' # Minikube
brew 'mkcert' # Local SSL
brew 'nss' # NSS
brew 'postgresql@12', restart_service: true # PG 12
brew 'python' # Python
brew 'redis', restart_service: true # Redis
brew 'ripgrep' # Ripgrep
brew 'ripgrep-all' # Ripgrep all
brew 'tfenv' # Terraform version manager
brew 'vault' # Vault
brew 'wget' # Wget
brew 'yamllint' # YAML linter
brew 'zsh' # Zsh
brew 'powerlevel10k' # Powerlevel10k

cask 'ngrok' # requires for Auth0 login

# Fonts
cask 'font-3270-nerd-font'
cask 'font-agave-nerd-font'
cask 'font-anonymice-nerd-font'
cask 'font-arimo-nerd-font'
cask 'font-aurulent-sans-mono-nerd-font'
cask 'font-awesome-terminal-fonts'  # Font Awesome for terminal
cask 'font-bigblue-terminal-nerd-font'
cask 'font-bitstream-vera-sans-mono-nerd-font'
cask 'font-blex-mono-nerd-font'
cask 'font-caskaydia-cove-nerd-font'
cask 'font-code-new-roman-nerd-font'
cask 'font-cousine-nerd-font'
cask 'font-daddy-time-mono-nerd-font'
cask 'font-dejavu-sans-mono-nerd-font'
cask 'font-droid-sans-mono-nerd-font'
cask 'font-fantasque-sans-mono-nerd-font'
cask 'font-fira-code' # Fira Code font
cask 'font-fira-code-nerd-font'
cask 'font-fira-mono-nerd-font'
cask 'font-go-mono-nerd-font'
cask 'font-gohufont-nerd-font'
cask 'font-hack-nerd-font'
cask 'font-hasklug-nerd-font'
cask 'font-heavy-data-nerd-font'
cask 'font-hurmit-nerd-font'
cask 'font-im-writing-nerd-font'
cask 'font-inconsolata-go-nerd-font'
cask 'font-inconsolata-lgc-nerd-font'
cask 'font-inconsolata-nerd-font'
cask 'font-iosevka-nerd-font'
cask 'font-jetbrains-mono-nerd-font'
cask 'font-lekton-nerd-font'
cask 'font-liberation-nerd-font'
cask 'font-meslo-lg-nerd-font'
cask 'font-monofur-nerd-font'
cask 'font-monoid-nerd-font'
cask 'font-mononoki-nerd-font'
cask 'font-mplus-nerd-font'
cask 'font-noto-nerd-font'
cask 'font-open-dyslexic-nerd-font'
cask 'font-overpass-nerd-font'
cask 'font-profont-nerd-font'
cask 'font-proggy-clean-tt-nerd-font'
cask 'font-roboto-mono-nerd-font'
cask 'font-sauce-code-pro-nerd-font'
cask 'font-shure-tech-mono-nerd-font'
cask 'font-space-mono-nerd-font'
cask 'font-terminess-ttf-nerd-font'
cask 'font-tinos-nerd-font'
cask 'font-ubuntu-mono-nerd-font'
cask 'font-ubuntu-nerd-font'
cask 'font-victor-mono-nerd-font'
cask 'homebrew/cask-fonts/font-fontawesome' # Font Awesome

# Apps
cask '1password' # 1Password
cask 'aws-vpn-client' # AWS VPN
cask 'docker' # Docker
cask 'iterm2' unless system ".local/bin/installed iTerm.app" # iTerm2 unless already installed
cask 'shottr' # Screenshot
cask 'slack' unless system ".local/bin/installed Slack.app" # Slack unless already installed
cask 'spotify' # Spotify
cask 'the-unarchiver' # Unarchiver
cask 'visual-studio-code' # VSCode
cask 'rubymine' # Rubymine
cask 'zoom' unless system ".local/bin/installed 'zoom.us.app'" # Zoom unless already installed
cask 'maccy' # Clipboard manager
cask 'notion' # Notion
cask 'dbeaver-community' # DBeaver
cask 'marvin' # Amazing Marvin
cask 'postman' # Postman
cask 'logi-options-plus' # Logitech Options for MX mouse
cask 'cold-turkey-blocker' # Cold Turkey
cask 'rescuetime' # RescueTime
cask 'notunes' # NoTunes https://github.com/tombonez/noTunes
cask 'charmstone' # App manager
cask 'karabiner-elements' # Keyboard manager + Hyperkey
cask 'raycast' #spotlight replacement

# Mac Apple Store
mas 'Boop', id: 1518425043 # Various developer tools
mas 'Magnet', id: 441258766 # Window manager
mas 'Spark', id: 1176895641 # Email manager
mas 'Hidden Bar', id: 1452453066 # Hidden menu bar

# VSCode extensions (I don't use VSCode currently)
# vscode 'hashicorp.terraform' # Terraform
# vscode 'eamodio.gitlens' # GitLens
# vscode 'dbaeumer.vscode-eslint' # ESLint
# vscode 'editorconfig.editorconfig' # EditorConfig
# vscode 'misogi.ruby-rubocop' # Rubocop
# vscode 'shopify.ruby-lsp' # Ruby LSP
# vscode 'sissel.shopify-liquid' # Shopify Liquid
# vscode 'shopify.theme-check-vscode' # Shopify
# vscode 'mechatroner.rainbow-csv' # CSV
# vscode 'esbenp.prettier-vscode' # Prettier
# vscode 'yzhang.markdown-all-in-one' # Markdown
# vscode 'britesnow.vscode-toggle-quotes' # Toggle quotes
# vscode 'deerawan.vscode-dash' # Dash
# vscode 'golang.go' # Go
# vscode 'irongeek.vscode-env' # .env
# vscode 'ivhernandez.vscode-plist' # PList Editor
# vscode 'johnpapa.vscode-peacock' # Peacock
# vscode 'ms-azuretools.vscode-docker' # Docker
# vscode 'sharashchandradesai.simple-scratch' # Scratch Pads
# vscode 'solomonkinard.git-blame' # Git Blame
# vscode 'vortizhe.simple-ruby-erb' # Ruby ERB
# vscode 'vscodevim.vim' # Vim
# vscode 'yoavbls.pretty-ts-errors' # Pretty TS errors
# vscode 'jannisberndt.dark-orange' # Dark Orange theme
# vscode 'pkief.material-icon-theme' # Material icons
